managers = {
    'Москва' : {
        'Валерий Канунников' : 'U01DA2EEK36',
        'Дарина Цыбенова' : 'U024VGCDWRL',
        'Егор Гусев' : 'U01RE50GQPN'
    },
    'Санкт-Петербург' : {
        'Андрей Стадник' : 'U01LV4UDC3W',
        'Артур Ахметов' : 'U01T9J9TYJX'
    },
    'Самара' : {
        'Ольга Дивиткина' : 'U01NPRL38DT'
    },
    'Саратов и Энгельс' : {
        'Ольга Дивиткина' : 'U01NPRL38DT'
    },
    'Ульяновск' : {
        'Ольга Дивиткина' : 'U01NPRL38DT'
    },
    'Тольятти' : {
        'Ольга Дивиткина' : 'U01NPRL38DT'
    },
    'Казань' : {
        'Илья Дёмин' : 'U01FT0P7ZTN'
    },
    'Уфа': {
        'Илья Дёмин' : 'U01FT0P7ZTN'
    },
    'Нижний Новгород' : {
        'Илья Дёмин' : 'U01FT0P7ZTN'
    },
    'Ярославль' : {
        'Илья Дёмин' : 'U01FT0P7ZTN'
    },
    'Краснодар' : {
        'Антон Яковенко' : 'U01N184AQVC'
    },
    'Ростов' : {
        'Антон Яковенко' : 'U01N184AQVC'
    },
    'Сочи' : {
        'Антон Яковенко' : 'U01N184AQVC'
    },
    'Воронеж' : {
        'Антон Яковенко' : 'U01N184AQVC'
    },
    'Новосибирск' : {
        'Влад Балакин' : 'U01UC3NSD55'
    },
    'Омск' : {
        'Влад Балакин' : 'U01UC3NSD55'
    },
    'Красноярск' : {
        'Влад Балакин' : 'U01UC3NSD55'
    },
    'Екатеринбург' : {
        'Роман Хабаров' : 'U025UH0MDL4'
    },
    'Пермь' : {
        'Роман Хабаров' : 'U025UH0MDL4'
    },
    'Челябинск' : {
        'Роман Хабаров' : 'U025UH0MDL4'
    },
    'Тюмень' : {
        'Роман Хабаров' : 'U025UH0MDL4'
    },
    'Сыктывкар' : {
        'Роман Хабаров' : 'U025UH0MDL4'
    }
}
